# считываем целые числа
num = int(input("Введите целое число: "))
# Вычисляем предыдущее и следующее числа
pr_num = num - 1
next_num = num + 1
print(f"Следующее за числом {num} число: {pr_num}, Для числа {num} предыдущее число: {next_num}")


#>>
#>>> num = int(input("Введите целое число: "))
#Введите целое число: 20
#>>> pr_num = num - 1
#>>> next_num = num + 1
#>>> print(f"Следующее за числом {num} число: {pr_num}, Для числа {num} предыдущее число: {next_num}")
#Следующее за числом 20 число: 19, Для числа 20 предыдущее число: 21
#>>>