import utils

def main() -> None:
    message = input("текст сообщения:")

    print(utils.important_message(message))
    

main()


    
#C:\Users\Админ\Scripts\Markina\2024.11.30>python -i 2.py
#текст сообщения:ЗАГОЛОВОК ПРОГРАММЫ
##===================================================================#
##                                                                   #
##                        ЗАГОЛОВОК ПРОГРАММЫ                        #
##                                                                   #
##===================================================================#
#>>> main()
#текст сообщения:Обратите внимание на сообщение этой шедевральной программы от разработчиков, которые очень старались
##===================================================================#
##                                                                   #
##   Обратите внимание на сообщение этой шедевральной программы от   #
##               разработчиков, которые очень старались              #
##                                                                   #
##===================================================================#
#>>>
